export const data = {
  projects: [
    {
      title: "مار-بازی کلاسیک",
      description:
        "این بازی یادآور خاطرات بازی‌های نوکیا است که می‌توانید از طریق لینک پایین بازی کنید و لذت ببرید. در این پروژه تلاش شده است تا کدی تمیز، قابل فهم و با قابلیت استفاده مجدد نوشته شود. تمامی منطق بازی توسط خودم نوشته شده و از هیچ کتابخانه یا جزء از پیش آماده‌ای استفاده نشده است. از ویژگی‌های برجسته این بازی می‌توان به داشتن صدا و قابلیت بازی در موبایل‌های هوشمند اشاره کرد.",
      technologies: ["HTML", "CSS", "JavaScript"],
      link: "https://snake-game-khaki-eta.vercel.app/",
      code: "https://github.com/erufan/snake_game",
      picturs: [
        "snake-game/1.webp",
        "snake-game/2.webp",
        "snake-game/3.webp",
        "snake-game/4.webp",
      ],
    },
    {
      title: "وب سایت هواشناسی",
      description:
        "اطلاعات دقیق و به‌روز وضعیت آب و هوا و پیش‌بینی سه روز آینده را ارائه می‌دهد. این اطلاعات شامل درصد بارش، سرعت باد، رطوبت، دما و وضعیت آسمان است. طراحی واکنش‌گرا (ریسپانسیو) سایت، نمایش بهینه در تمامی دستگاه‌ها را تضمین می‌کند. انیمیشن‌های زیبا و جذاب برای آیکون‌ها، تجربه کاربری را بهبود می‌بخشند و عملکرد سایت حتی پس از چندین بار رندر مجدد حفظ میشود.قابلیت جستجوی شهرها با پشتیبانی از تمامی شهرها و تکمیل خودکار (autocomplete) نام شهرها، جستجو را آسان‌تر میکند.",
      technologies: ["HTML", "CSS", "JavaScript", "API"],
      link: "https://checkerfanweather.netlify.app/",
      code: "https://github.com/erufan/weather-app",
      picturs: [
        "weather-app/1.webp",
        "weather-app/2.webp",
        "weather-app/3.webp",
        "weather-app/4.webp",
      ],
    },
    {
      title: "ماشین حساب",
      description:
        "پروژه ماشین حساب من شامل انجام چهار عمل اصلی ضرب، تقسیم، جمع و تفریق است. این ماشین حساب به طور خودکار ترتیب عملیات را رعایت می‌کند و امکان استفاده مجدد از جواب در محاسبات بعدی را فراهم می‌سازد. طراحی این ماشین حساب به گونه‌ای است که کاربر بتواند به راحتی و با دقت بالا محاسبات خود را انجام دهد.",
      technologies: ["HTML", "CSS", "JavaScript"],
      link: "https://iridescent-selkie-507e3d.netlify.app/",
      code: "https://github.com/erufan/calculator",
      picturs: [
        "calculator/1.webp",
        "calculator/2.webp",
        "calculator/3.webp",
        "calculator/4.webp",
      ],
    },
    {
      title: "تغییر وضعیت دارک مود",
      description:
        "دکمه دارک مود شامل دکمه‌های خورشید و ماه برای تغییر حالت دارک مود است. این پروژه به عنوان یک کار تفننی طراحی شده و هدف اصلی آن شبیه‌سازی هوک useState و React با استفاده از وانیلا جاوا اسکریپت بوده است. این پروژه بیشتر بر خلاقیت فردی تمرکز دارد و ویژگی خاص دیگری ندارد. با این حال، این پروژه می‌تواند به عنوان یک نمونه ساده و آموزشی برای کسانی که می‌خواهند با مفاهیم پایه‌ای React و جاوا اسکریپت آشنا شوند، مفید باشد. طراحی آن به تجربه‌ای متفاوت از رابط کاربری ختم میشود",
      technologies: ["HTML", "CSS", "JavaScript"],
      link: "https://moon-sun-form.netlify.app/",
      code: "https://github.com/erufan/moon-sun-form",
      picturs: [
        "dark-mod/1.webp",
        "dark-mod/2.webp",
        "dark-mod/3.webp",
        "dark-mod/4.webp",
      ],
    },
    {
      title: "وب سایت بازی",
      description:
        "سایت نمایش بازی قابلیت فیلتر کردن بازی‌ها بر اساس ژانر و مرتب‌سازی آن‌ها بر اساس تاریخ انتشار، محبوبیت، الفبا و پلتفرم را دارد. این پروژه به عنوان یک پروژه PBL طراحی شده است. در این سایت، کاربران می‌توانند به راحتی بازی‌های مورد علاقه خود را پیدا کنند و تجربه‌ای لذت‌بخش از جستجو و انتخاب بازی‌ها داشته باشند. علاوه بر این، سایت دارای رابط کاربری ساده و کاربرپسند است که به کاربران امکان می‌دهد به سرعت به اطلاعات مورد نیاز خود دسترسی پیدا کنند. همچنین، تلاش شده است تا کد سایت تمیز و قابل فهم باشد تا توسعه‌دهندگان دیگر نیز بتوانند به راحتی آن را گسترش دهند و بهبود بخشند.",
      technologies: ["HTML", "CSS", "JavaScript", "API"],
      link: "https://sage-starship-958dd0.netlify.app/",
      code: "https://github.com/erufan/game-hubs",
      picturs: [
        "game-hub/1.webp",
        "game-hub/2.webp",
        "game-hub/3.webp",
        "game-hub/4.webp",
      ],
    },
  ],
};
