export const data = {
  projects: [
    {
      title: "مار-بازی کلاسیک",
      description:
        "این بازی یادآور خاطرات بازی‌های نوکیا است که می‌توانید از طریق لینک پایین بازی کنید و لذت ببرید. در این پروژه تلاش شده است تا کدی تمیز، قابل فهم و با قابلیت استفاده مجدد نوشته شود. تمامی منطق بازی توسط خودم نوشته شده و از هیچ کتابخانه یا جزء از پیش آماده‌ای استفاده نشده است. از ویژگی‌های برجسته این بازی می‌توان به داشتن صدا و قابلیت بازی در موبایل‌های هوشمند اشاره کرد.",
      technologies: ["HTML", "CSS", "JavaScript"],
      link: "https://snake-game-khaki-eta.vercel.app/",
      code: "https://github.com/erufan/snake_game",
      picturs: [
        "snake-game/1.webp",
        "snake-game/2.webp",
        "snake-game/3.webp",
        "snake-game/4.webp",
      ],
    },
    {
      title: "وب سایت هواشناسی",
      description:
        "اطلاعات دقیق و به‌روز وضعیت آب و هوا و پیش‌بینی سه روز آینده را ارائه می‌دهد. این اطلاعات شامل درصد بارش، سرعت باد، رطوبت، دما و وضعیت آسمان است. طراحی واکنش‌گرا (ریسپانسیو) سایت، نمایش بهینه در تمامی دستگاه‌ها را تضمین می‌کند. انیمیشن‌های زیبا و جذاب برای آیکون‌ها، تجربه کاربری را بهبود می‌بخشند و عملکرد سایت حتی پس از چندین بار رندر مجدد حفظ میشود.قابلیت جستجوی شهرها با پشتیبانی از تمامی شهرها و تکمیل خودکار (autocomplete) نام شهرها، جستجو را آسان‌تر میکند.",
      technologies: ["HTML", "CSS", "JavaScript", "API"],
      link: "https://checkerfanweather.netlify.app/",
      code: "https://github.com/erufan/weather-app",
      picturs: [
        "weather-app/1.webp",
        "weather-app/2.webp",
        "weather-app/3.webp",
        "weather-app/4.webp",
      ],
    },
    {
      title: "ماشین حساب",
      description:
        "پروژه ماشین حساب من شامل انجام چهار عمل اصلی ضرب، تقسیم، جمع و تفریق است. این ماشین حساب به طور خودکار ترتیب عملیات را رعایت می‌کند و امکان استفاده مجدد از جواب در محاسبات بعدی را فراهم می‌سازد. طراحی این ماشین حساب به گونه‌ای است که کاربر بتواند به راحتی و با دقت بالا محاسبات خود را انجام دهد.",
      technologies: ["HTML", "CSS", "JavaScript"],
      link: "https://erfancalculator.netlify.app/",
      code: "https://github.com/erufan/calculator",
      picturs: [
        "calculator/1.webp",
        "calculator/2.webp",
        "calculator/3.webp",
        "calculator/4.webp",
      ],
    },
    {
      title: "تغییر وضعیت دارک مود",
      description:
        "دکمه دارک مود شامل دکمه‌های خورشید و ماه برای تغییر حالت دارک مود است. این پروژه به عنوان یک کار تفننی طراحی شده و هدف اصلی آن شبیه‌سازی هوک useState و React با استفاده از وانیلا جاوا اسکریپت بوده است. این پروژه بیشتر بر خلاقیت فردی تمرکز دارد و ویژگی خاص دیگری ندارد. با این حال، این پروژه می‌تواند به عنوان یک نمونه ساده و آموزشی برای کسانی که می‌خواهند با مفاهیم پایه‌ای React و جاوا اسکریپت آشنا شوند، مفید باشد. طراحی آن به تجربه‌ای متفاوت از رابط کاربری ختم میشود",
      technologies: ["HTML", "CSS", "JavaScript"],
      link: "https://moon-sun-form.netlify.app/",
      code: "https://github.com/erufan/moon-sun-form",
      picturs: [
        "dark-mod/1.webp",
        "dark-mod/2.webp",
        "dark-mod/3.webp",
        "dark-mod/4.webp",
      ],
    },
    {
      title: "وب سایت بازی",
      description:
        "سایت نمایش بازی قابلیت فیلتر کردن بازی‌ها بر اساس ژانر و مرتب‌سازی آن‌ها بر اساس تاریخ انتشار، محبوبیت، الفبا و پلتفرم را دارد. این پروژه به عنوان یک پروژه PBL طراحی شده است. در این سایت، کاربران می‌توانند به راحتی بازی‌های مورد علاقه خود را پیدا کنند و تجربه‌ای لذت‌بخش از جستجو و انتخاب بازی‌ها داشته باشند. علاوه بر این، سایت دارای رابط کاربری ساده و کاربرپسند است که به کاربران امکان می‌دهد به سرعت به اطلاعات مورد نیاز خود دسترسی پیدا کنند. همچنین، تلاش شده است تا کد سایت تمیز و قابل فهم باشد تا توسعه‌دهندگان دیگر نیز بتوانند به راحتی آن را گسترش دهند و بهبود بخشند.",
      technologies: ["HTML", "CSS", "JavaScript", "API"],
      link: "https://erfangamehub.netlify.app",
      code: "https://github.com/erufan/game-hubs",
      picturs: [
        "game-hub/1.webp",
        "game-hub/2.webp",
        "game-hub/3.webp",
        "game-hub/4.webp",
      ],
    },
    {
      title: "مدیریت وظایف",
      description: `این وب‌سایت در ابتدا به‌عنوان یک چالش کدنویسی از سوی شرکت ویم پارس مطرح شد. چالش این بود که یک سایت مدیریت وظایف با استفاده از API‌های ارائه‌شده توسط شرکت و یک پایگاه داده شبیه‌ سازی ‌شده و احراز هویت مبتنی بر JWT ساخته شود. با اینکه پروژه را با استفاده از API‌های خواسته ‌شده تکمیل کردم، متأسفانه به دلیل کم‌تجربگی‌ام، شرکت من را نپذیرفت.
اما از آنجا که پروژه با API و پایگاه داده شبیه ‌سازی‌شده ساخته شده بود و بخش عمده‌ای از کار انجام شده بود، تصمیم گرفتم آن را با استفاده از یک پایگاه داده واقعی و API‌های خودم توسعه دهم. احراز هویت در نسخه جدید به صورت session-based پیاده ‌سازی شده است.
در این وب‌سایت کاربران می‌توانند ثبت‌نام کنند، لیست وظایف دیگران را مشاهده کنند، و وظایف خود را اضافه، ویرایش و حذف کنند
`,
      technologies: [
        "HTML",
        "CSS",
        "antdesign",
        "nextjs",
        "lucia",
        "postgresql",
        "vercel",
        "api",
      ],
      link: "https://erfan-todo.vercel.app/",
      code: "https://github.com/erufan/erfanTodo",
      picturs: [
        "todo-app/1.webp",
        "todo-app/2.webp",
        "todo-app/3.webp",
        "todo-app/4.webp",
      ],
    },
    {
      title: "تلاش برای کلون کردن قسمتی از سایت بازی دوتا2",
      description: `بخشی از وب‌سایت دوتا 2 را کلون کردم. برای این منظور، ابتدا لازم بود داده‌ها را از وب‌سایت اصلی دوتا 2 استخراج کنم. این پروژه باعث تقویت مهارت‌های وب اسکرپینگ (Web Scraping) من شد، چرا که از کتابخانه قدرتمند Puppeteer استفاده کردم. با بهره‌گیری از این ابزار، داده‌ها را از وب‌سایت دوتا 2 دریافت کرده و سعی کردم آن‌ها را در وب‌سایت خودم پیاده‌سازی کنم.
در این وب‌سایت، شما قادر خواهید بود هیروها (که می‌توانید آن‌ها را به عنوان محصولات در نظر بگیرید) را بر اساس قدرت، نام و میزان سختی پیدا کنید. هر هیرو صفحه مخصوص به خود را دارد، که در آن می‌توانید تاریخچه هیرو، تصویر کامل، قدرت‌ها و توضیحات مربوط به آن‌ها را مطالعه و مشاهده نمایید.
از آنجا که توسعه این پروژه به دلیل پیچیدگی‌های وب اسکرپینگ بسیار زمان‌بر بود، تمرکز من بیشتر بر روی ویژگی‌هایی بود که به افزایش مهارت‌هایم کمک می‌کردند. این پروژه تجربه‌ای ارزشمند در به‌کارگیری تکنیک‌های پیشرفته برای استخراج و استفاده از داده‌های وب به من بخشید. نتیجه نهایی، یک وب‌سایت کاربردی است که به کاربران امکان می‌دهد به سادگی در میان هیروها جستجو کنند و اطلاعات جامعی درباره هرکدام به دست آورند، در حالی که مهارت‌های من در زمینه وب اسکرپینگ و توسعه وب به طور قابل توجهی بهبود یافته است. 
`,
      technologies: [
        "HTML",
        "CSS",
        "tailwind",
        "nextjs",
        "typescript",
        "puppeteer",
        "vercel",
      ],
      link: "https://clone-dota2-website.vercel.app",
      code: "https://github.com/erufan/clone-dota2-website",
      picturs: [
        "dota2-clone/1.webp",
        "dota2-clone/2.webp",
        "dota2-clone/3.webp",
        "dota2-clone/4.webp",
        "dota2-clone/5.webp",
        "dota2-clone/6.webp",
      ],
    },
    {
      title: "سایت غذا",
      description: `به به سایت غذا! در این وب‌سایت، شما می‌توانید لیست کاملی از غذاهای اضافه‌شده را مشاهده کرده و همچنین غذای مورد علاقه خود را به این لیست اضافه کنید و از تجربه‌ی طعم‌های متفاوت لذت ببرید.
این پروژه در ابتدا به‌عنوان یک پروژه مبتنی بر یادگیری عملی (PBL) شکل گرفت، اما مدرس هرگز آن را به مرحله‌ی دیپلوی نرساند و پایگاه داده‌ای که استفاده می‌کرد، sqlite3 بود. با این حال، من تصمیم گرفتم سایت را دیپلوی کنم و به‌جای استفاده از sqlite3، از پایگاه داده قوی‌تر postgresql بهره ببرم.
`,
      technologies: ["HTML", "CSS", "nextjs", "typescript", "vercel"],
      link: "https://food-app-nu-hazel.vercel.app/",
      code: "https://github.com/erufan/food-app",
      picturs: [
        "food-app/1.webp",
        "food-app/2.webp",
        "food-app/3.webp",
        "food-app/4.webp",
      ],
    },
  ],
};
